In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  1.105184 -1.358819
1    a  two  0.952712 -0.310551
2    b  one  1.358060 -1.177912
3    b  two -0.520278 -0.106175
4    a  one -0.219283 -1.492060

In [4]:
grouped = df['data1'].groupby(df['key1'])  # 根据Serises进行分组
grouped

In [5]:
grouped.mean()

key1
a    0.612871
b    0.418891
Name: data1, dtype: float64

In [6]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()  # 根据多个Serises进行分组
means

key1  key2
a     one     0.442950
      two     0.952712
b     one     1.358060
      two    -0.520278
Name: data1, dtype: float64

In [7]:
means.unstack()

key2      one       two
key1
a     0.44295  0.952712
b     1.35806 -0.520278

In [8]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])

df['data1'].groupby([states, years]).mean()  # 分组键可以是任何长度适当的数组，甚至不属于DataFrame

California  2005    0.952712
            2006    1.358060
Ohio        2005    0.292453
            2006   -0.219283
Name: data1, dtype: float64

In [9]:
df.groupby('key1').mean()  # key2列不是数值，默认情况下自动忽略

         data1     data2
key1
a     0.612871 -1.053810
b     0.418891 -0.642044

In [10]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one   0.442950 -1.425439
     two   0.952712 -0.310551
b    one   1.358060 -1.177912
     two  -0.520278 -0.106175

In [11]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64